docs/benchmarks/comparisons/20260509_233752_4stage_c500_d60s/stage2/intake_only_run_raw.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: scripts/k6_intake_only.js
        output: -

     scenarios: (100.00%) 1 scenario, 500 max VUs, 1m30s max duration (incl. graceful stop):
              * intake_only: 500 looping VUs for 1m0s (gracefulStop: 30s)

time="2026-05-09T23:42:57+08:00" level=info msg="[setup] event_id=1df23684-c4f9-4524-947d-52f7a6b427b2 ticket_type_id=019e0d67-f4a6-7243-ab91-a6548dbeb41c pool=500000" source=console

running (0m01.0s), 500/500 VUs, 15278 complete and 0 interrupted iterations
intake_only   [   2% ] 500 VUs  0m01.0s/1m0s

running (0m02.0s), 500/500 VUs, 31238 complete and 0 interrupted iterations
intake_only   [   3% ] 500 VUs  0m02.0s/1m0s

running (0m03.0s), 500/500 VUs, 47229 complete and 0 interrupted iterations
intake_only   [   5% ] 500 VUs  0m03.0s/1m0s

running (0m04.0s), 500/500 VUs, 61196 complete and 0 interrupted iterations
intake_only   [   7% ] 500 VUs  0m04.0s/1m0s

running (0m05.0s), 500/500 VUs, 76162 complete and 0 interrupted iterations
intake_only   [   8% ] 500 VUs  0m05.0s/1m0s

running (0m06.0s), 500/500 VUs, 91726 complete and 0 interrupted iterations
intake_only   [  10% ] 500 VUs  0m06.0s/1m0s

running (0m07.0s), 500/500 VUs, 106634 complete and 0 interrupted iterations
intake_only   [  12% ] 500 VUs  0m07.0s/1m0s

running (0m08.0s), 500/500 VUs, 121241 complete and 0 interrupted iterations
intake_only   [  13% ] 500 VUs  0m08.0s/1m0s

running (0m09.0s), 500/500 VUs, 134148 complete and 0 interrupted iterations
intake_only   [  15% ] 500 VUs  0m09.0s/1m0s

running (0m10.0s), 500/500 VUs, 149887 complete and 0 interrupted iterations
intake_only   [  17% ] 500 VUs  0m10.0s/1m0s

running (0m11.0s), 500/500 VUs, 165640 complete and 0 interrupted iterations
intake_only   [  18% ] 500 VUs  0m11.0s/1m0s

running (0m12.0s), 500/500 VUs, 181185 complete and 0 interrupted iterations
intake_only   [  20% ] 500 VUs  0m12.0s/1m0s

running (0m13.0s), 500/500 VUs, 194645 complete and 0 interrupted iterations
intake_only   [  22% ] 500 VUs  0m13.0s/1m0s

running (0m14.0s), 500/500 VUs, 210092 complete and 0 interrupted iterations
intake_only   [  23% ] 500 VUs  0m14.0s/1m0s

running (0m15.0s), 500/500 VUs, 225537 complete and 0 interrupted iterations
intake_only   [  25% ] 500 VUs  0m15.0s/1m0s

running (0m16.0s), 500/500 VUs, 241367 complete and 0 interrupted iterations
intake_only   [  27% ] 500 VUs  0m16.0s/1m0s

running (0m17.0s), 500/500 VUs, 255449 complete and 0 interrupted iterations
intake_only   [  28% ] 500 VUs  0m17.0s/1m0s

running (0m18.0s), 500/500 VUs, 271344 complete and 0 interrupted iterations
intake_only   [  30% ] 500 VUs  0m18.0s/1m0s

running (0m19.0s), 500/500 VUs, 286062 complete and 0 interrupted iterations
intake_only   [  32% ] 500 VUs  0m19.0s/1m0s

running (0m20.0s), 500/500 VUs, 302292 complete and 0 interrupted iterations
intake_only   [  33% ] 500 VUs  0m20.0s/1m0s

running (0m21.0s), 500/500 VUs, 318492 complete and 0 interrupted iterations
intake_only   [  35% ] 500 VUs  0m21.0s/1m0s

running (0m22.0s), 500/500 VUs, 334517 complete and 0 interrupted iterations
intake_only   [  37% ] 500 VUs  0m22.0s/1m0s

running (0m23.0s), 500/500 VUs, 347247 complete and 0 interrupted iterations
intake_only   [  38% ] 500 VUs  0m23.0s/1m0s

running (0m24.0s), 500/500 VUs, 361981 complete and 0 interrupted iterations
intake_only   [  40% ] 500 VUs  0m24.0s/1m0s

running (0m25.0s), 500/500 VUs, 376258 complete and 0 interrupted iterations
intake_only   [  42% ] 500 VUs  0m25.0s/1m0s

running (0m26.0s), 500/500 VUs, 387517 complete and 0 interrupted iterations
intake_only   [  43% ] 500 VUs  0m26.0s/1m0s

running (0m27.0s), 500/500 VUs, 397895 complete and 0 interrupted iterations
intake_only   [  45% ] 500 VUs  0m27.0s/1m0s

running (0m28.0s), 500/500 VUs, 412694 complete and 0 interrupted iterations
intake_only   [  47% ] 500 VUs  0m28.0s/1m0s

running (0m29.0s), 500/500 VUs, 426260 complete and 0 interrupted iterations
intake_only   [  48% ] 500 VUs  0m29.0s/1m0s

running (0m30.0s), 500/500 VUs, 439713 complete and 0 interrupted iterations
intake_only   [  50% ] 500 VUs  0m30.0s/1m0s

running (0m31.0s), 500/500 VUs, 452467 complete and 0 interrupted iterations
intake_only   [  52% ] 500 VUs  0m31.0s/1m0s

running (0m32.0s), 500/500 VUs, 467989 complete and 0 interrupted iterations
intake_only   [  53% ] 500 VUs  0m32.0s/1m0s

running (0m33.0s), 500/500 VUs, 483348 complete and 0 interrupted iterations
intake_only   [  55% ] 500 VUs  0m33.0s/1m0s

running (0m34.0s), 500/500 VUs, 498535 complete and 0 interrupted iterations
intake_only   [  57% ] 500 VUs  0m34.0s/1m0s

running (0m35.0s), 500/500 VUs, 515027 complete and 0 interrupted iterations
intake_only   [  58% ] 500 VUs  0m35.0s/1m0s

running (0m36.0s), 500/500 VUs, 531159 complete and 0 interrupted iterations
intake_only   [  60% ] 500 VUs  0m36.0s/1m0s

running (0m37.0s), 500/500 VUs, 545258 complete and 0 interrupted iterations
intake_only   [  62% ] 500 VUs  0m37.0s/1m0s

running (0m38.0s), 500/500 VUs, 557791 complete and 0 interrupted iterations
intake_only   [  63% ] 500 VUs  0m38.0s/1m0s

running (0m39.0s), 500/500 VUs, 571625 complete and 0 interrupted iterations
intake_only   [  65% ] 500 VUs  0m39.0s/1m0s

running (0m40.0s), 500/500 VUs, 585806 complete and 0 interrupted iterations
intake_only   [  67% ] 500 VUs  0m40.0s/1m0s

running (0m41.0s), 500/500 VUs, 601254 complete and 0 interrupted iterations
intake_only   [  68% ] 500 VUs  0m41.0s/1m0s

running (0m42.0s), 500/500 VUs, 614331 complete and 0 interrupted iterations
intake_only   [  70% ] 500 VUs  0m42.0s/1m0s

running (0m43.0s), 500/500 VUs, 628452 complete and 0 interrupted iterations
intake_only   [  72% ] 500 VUs  0m43.0s/1m0s

running (0m44.0s), 500/500 VUs, 643695 complete and 0 interrupted iterations
intake_only   [  73% ] 500 VUs  0m44.0s/1m0s

running (0m45.0s), 500/500 VUs, 659785 complete and 0 interrupted iterations
intake_only   [  75% ] 500 VUs  0m45.0s/1m0s

running (0m46.0s), 500/500 VUs, 674572 complete and 0 interrupted iterations
intake_only   [  77% ] 500 VUs  0m46.0s/1m0s

running (0m47.0s), 500/500 VUs, 686965 complete and 0 interrupted iterations
intake_only   [  78% ] 500 VUs  0m47.0s/1m0s

running (0m48.0s), 500/500 VUs, 716155 complete and 0 interrupted iterations
intake_only   [  80% ] 500 VUs  0m48.0s/1m0s

running (0m49.0s), 500/500 VUs, 754674 complete and 0 interrupted iterations
intake_only   [  82% ] 500 VUs  0m49.0s/1m0s

running (0m50.0s), 500/500 VUs, 800082 complete and 0 interrupted iterations
intake_only   [  83% ] 500 VUs  0m50.0s/1m0s

running (0m51.0s), 500/500 VUs, 836456 complete and 0 interrupted iterations
intake_only   [  85% ] 500 VUs  0m51.0s/1m0s

running (0m52.0s), 500/500 VUs, 878516 complete and 0 interrupted iterations
intake_only   [  87% ] 500 VUs  0m52.0s/1m0s

running (0m53.0s), 500/500 VUs, 921572 complete and 0 interrupted iterations
intake_only   [  88% ] 500 VUs  0m53.0s/1m0s

running (0m54.0s), 500/500 VUs, 964862 complete and 0 interrupted iterations
intake_only   [  90% ] 500 VUs  0m54.0s/1m0s

running (0m55.0s), 500/500 VUs, 1004644 complete and 0 interrupted iterations
intake_only   [  92% ] 500 VUs  0m55.0s/1m0s

running (0m56.0s), 500/500 VUs, 1046089 complete and 0 interrupted iterations
intake_only   [  93% ] 500 VUs  0m56.0s/1m0s

running (0m57.0s), 500/500 VUs, 1087866 complete and 0 interrupted iterations
intake_only   [  95% ] 500 VUs  0m57.0s/1m0s

running (0m58.0s), 500/500 VUs, 1123413 complete and 0 interrupted iterations
intake_only   [  97% ] 500 VUs  0m58.0s/1m0s

running (0m59.0s), 500/500 VUs, 1157745 complete and 0 interrupted iterations
intake_only   [  98% ] 500 VUs  0m59.0s/1m0s

running (1m00.0s), 500/500 VUs, 1195240 complete and 0 interrupted iterations
intake_only   [ 100% ] 500 VUs  1m00.0s/1m0s


  █ THRESHOLDS 

    business_errors
    ✓ 'rate<0.05' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 1       0.016663/s
    checks_succeeded...: 100.00% 1 out of 1
    checks_failed......: 0.00%   0 out of 1

    ✓ event created

    CUSTOM
    accepted_bookings..............: 500800  8344.673124/s
    business_errors................: 0.00%   0 out of 500800

    HTTP
    http_req_duration..............: avg=25.02ms min=348µs    med=15.96ms max=445.47ms p(90)=52.76ms p(95)=70.79ms
      { expected_response:true }...: avg=33.46ms min=1.32ms   med=26.49ms max=445.47ms p(90)=66.43ms p(95)=85.78ms
    http_req_failed................: 58.15%  696121 out of 1196922
    http_reqs......................: 1196922 19943.935394/s

    EXECUTION
    iteration_duration.............: avg=25.05ms min=359.25µs med=15.99ms max=445.53ms p(90)=52.79ms p(95)=70.83ms
    iterations.....................: 1196921 19943.918731/s
    vus............................: 500     min=500               max=500
    vus_max........................: 500     min=500               max=500

    NETWORK
    data_received..................: 357 MB  6.0 MB/s
    data_sent......................: 264 MB  4.4 MB/s



running (1m00.0s), 000/500 VUs, 1196921 complete and 0 interrupted iterations
intake_only ✓ [ 100% ] 500 VUs  1m0s